{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[NUM]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[CAP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "[ALLCAPS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\d+(?:[.,]\\d+)*(?:[eE][-+]?\\d+)?|\\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Z|a-z]{2,}\\b|https?://\\S+|www\\.\\S+|[A-Za-z_]+(?:['\\-][A-Za-z_]+)*|[^\\s\\w\\d]|\\s+)"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "[NUM]": 5,
      "[CAP]": 6,
      "[ALLCAPS]": 7,
      " ": 8,
      "!": 9,
      "\"": 10,
      "#": 11,
      "$": 12,
      "%": 13,
      "&": 14,
      "'": 15,
      "(": 16,
      ")": 17,
      "*": 18,
      "+": 19,
      ",": 20,
      "-": 21,
      ".": 22,
      "/": 23,
      "0": 24,
      "1": 25,
      "2": 26,
      "3": 27,
      "4": 28,
      "5": 29,
      "6": 30,
      "7": 31,
      "9": 32,
      ":": 33,
      ";": 34,
      "<": 35,
      "=": 36,
      ">": 37,
      "?": 38,
      "@": 39,
      "A": 40,
      "B": 41,
      "C": 42,
      "D": 43,
      "E": 44,
      "F": 45,
      "H": 46,
      "I": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "[": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "a": 64,
      "b": 65,
      "c": 66,
      "d": 67,
      "e": 68,
      "f": 69,
      "g": 70,
      "h": 71,
      "i": 72,
      "j": 73,
      "k": 74,
      "l": 75,
      "m": 76,
      "n": 77,
      "o": 78,
      "p": 79,
      "q": 80,
      "r": 81,
      "s": 82,
      "t": 83,
      "u": 84,
      "v": 85,
      "w": 86,
      "x": 87,
      "y": 88,
      "{": 89,
      "}": 90,
      "¥": 91,
      "§": 92,
      "©": 93,
      "®": 94,
      "–": 95,
      "†": 96,
      "‡": 97,
      "€": 98,
      "™": 99,
      "∑": 100,
      "∞": 101,
      "👍": 102,
      "🚀": 103,
      "  ": 104,
      "en": 105,
      "th": 106,
      "er": 107,
      "nd": 108,
      "and": 109,
      "or": 110,
      "ar": 111,
      "is": 112,
      "at": 113,
      "ll": 114,
      "es": 115,
      "ld": 116,
      "wor": 117,
      "ell": 118,
      "in": 119,
      "mb": 120,
      "ent": 121,
      "world": 122,
      "ab": 123,
      "ac": 124,
      "ith": 125,
      "nu": 126,
      "on": 127,
      "sh": 128,
      "ti": 129,
      "with": 130,
      "    ": 131,
      "ing": 132,
      "mber": 133,
      "number": 134,
      "be": 135,
      "ce": 136,
      "et": 137,
      "nc": 138,
      "ot": 139,
      "sent": 140,
      "ul": 141,
      "unc": 142,
      "ence": 143,
      "sentence": 144,
      "-sh": 145,
      "-be": 146,
      "T-sh": 147,
      "ag": 148,
      "al": 149,
      "am": 150,
      "br": 151,
      "ca": 152,
      "e-": 153,
      "for": 154,
      "hy": 155,
      "hen": 156,
      "hell": 157,
      "ik": 158,
      "ip": 159,
      "ir": 160,
      "ion": 161,
      "le": 162,
      "lik": 163,
      "not": 164,
      "of": 165,
      "op": 166,
      "ou": 167,
      "phen": 168,
      "sp": 169,
      "st": 170,
      "tes": 171,
      "this": 172,
      "that": 173,
      "arg": 174,
      "ation": 175,
      "ell-be": 176,
      "tim": 177,
      "numbers": 178,
      "T-shir": 179,
      "brac": 180,
      "hyphen": 181,
      "hello": 182,
      "like": 183,
      "test": 184,
      "ell-being": 185,
      "T-shirt": 186,
      "'s": 187,
      "-t": 188,
      "-th": 189,
      "-wor": 190,
      "AD": 191,
      "At": 192,
      "BE": 193,
      "DE": 194,
      "EF": 195,
      "It": 196,
      "Wor": 197,
      "Well-being": 198,
      "_n": 199,
      "_ca": 200,
      "ay": 201,
      "ath": 202,
      "ash": 203,
      "ch": 204,
      "ci": 205,
      "car": 206,
      "cent": 207,
      "di": 208,
      "do": 209,
      "d-wor": 210,
      "day": 211,
      "ed": 212,
      "em": 213,
      "ev": 214,
      "eci": 215,
      "ff": 216,
      "ful": 217,
      "func": 218,
      "hash": 219,
      "ic": 220,
      "it": 221,
      "ix": 222,
      "iab": 223,
      "jis": 224,
      "ket": 225,
      "ls": 226,
      "lon": 227,
      "mat": 228,
      "mul": 229,
      "math": 230,
      "mix": 231,
      "nip": 232,
      "ond": 233,
      "ojis": 234,
      "ols": 235,
      "per": 236,
      "pet": 237,
      "punc": 238,
      "pag": 239,
      "ple": 240,
      "qu": 241,
      "res": 242,
      "runc": 243,
      "se": 244,
      "so": 245,
      "sy": 246,
      "ser": 247,
      "sis": 248,
      "snip": 249,
      "tu": 250,
      "ter": 251,
      "tab": 252,
      "top": 253,
      "trunc": 254,
      "user": 255,
      "var": 256,
      "well-being": 257,
      "wond": 258,
      "xab": 259,
      "xDE": 260,
      "xmath": 261,
      "yth": 262,
      "erent": 263,
      "erful": 264,
      "eryth": 265,
      "art": 266,
      "arac": 267,
      "ate-": 268,
      "ated": 269,
      "llar": 270,
      "ellip": 271,
      "mbols": 272,
      "abou": 273,
      "aces": 274,
      "on_ca": 275,
      "shou": 276,
      "tiple": 277,
      "tion_ca": 278,
      "otes": 279,
      "ult": 280,
      "also": 281,
      "ame": 282,
      "amp": 283,
      "case": 284,
      "e-art": 285,
      "format": 286,
      "le_n": 287,
      "notation": 288,
      "of-th": 289,
      "open": 290,
      "speci": 291,
      "spaces": 292,
      "star": 293,
      "state-": 294,
      "time": 295,
      "times": 296,
      "brace": 297,
      "bracket": 298,
      "hyphens": 299,
      "testing": 300,
      "-tag": 301,
      "ADBE": 302,
      "At-tag": 303,
      "It's": 304,
      "Word-wor": 305,
      "charac": 306,
      "caret": 307,
      "diff": 308,
      "dollar": 309,
      "emojis": 310,
      "everyth": 311,
      "function_ca": 312,
      "iable_n": 313,
      "long": 314,
      "multiple": 315,
      "percent": 316,
      "pets": 317,
      "punctu": 318,
      "page": 319,
      "quotes": 320,
      "result": 321,
      "symbols": 322,
      "snippets": 323,
      "ters": 324,
      "tabs": 325,
      "topic": 326,
      "truncated": 327,
      "variable_n": 328,
      "wonderful": 329,
      "xabc": 330,
      "xDEADBE": 331,
      "ellipsis": 332,
      "about": 333,
      "should": 334,
      "formats": 335,
      "of-the-art": 336,
      "special": 337,
      "state-of-the-art": 338,
      "Word-word": 339,
      "characters": 340,
      "different": 341,
      "everything": 342,
      "function_call": 343,
      "punctuation": 344,
      "variable_name": 345,
      "xDEADBEEF": 346
    },
    "merges": [
      [
        " ",
        " "
      ],
      [
        "e",
        "n"
      ],
      [
        "t",
        "h"
      ],
      [
        "e",
        "r"
      ],
      [
        "n",
        "d"
      ],
      [
        "a",
        "nd"
      ],
      [
        "o",
        "r"
      ],
      [
        "a",
        "r"
      ],
      [
        "i",
        "s"
      ],
      [
        "a",
        "t"
      ],
      [
        "l",
        "l"
      ],
      [
        "e",
        "s"
      ],
      [
        "l",
        "d"
      ],
      [
        "w",
        "or"
      ],
      [
        "e",
        "ll"
      ],
      [
        "i",
        "n"
      ],
      [
        "m",
        "b"
      ],
      [
        "en",
        "t"
      ],
      [
        "wor",
        "ld"
      ],
      [
        "a",
        "b"
      ],
      [
        "a",
        "c"
      ],
      [
        "i",
        "th"
      ],
      [
        "n",
        "u"
      ],
      [
        "o",
        "n"
      ],
      [
        "s",
        "h"
      ],
      [
        "t",
        "i"
      ],
      [
        "w",
        "ith"
      ],
      [
        "  ",
        "  "
      ],
      [
        "in",
        "g"
      ],
      [
        "mb",
        "er"
      ],
      [
        "nu",
        "mber"
      ],
      [
        "b",
        "e"
      ],
      [
        "c",
        "e"
      ],
      [
        "e",
        "t"
      ],
      [
        "n",
        "c"
      ],
      [
        "o",
        "t"
      ],
      [
        "s",
        "ent"
      ],
      [
        "u",
        "l"
      ],
      [
        "u",
        "nc"
      ],
      [
        "en",
        "ce"
      ],
      [
        "sent",
        "ence"
      ],
      [
        "-",
        "sh"
      ],
      [
        "-",
        "be"
      ],
      [
        "T",
        "-sh"
      ],
      [
        "a",
        "g"
      ],
      [
        "a",
        "l"
      ],
      [
        "a",
        "m"
      ],
      [
        "b",
        "r"
      ],
      [
        "c",
        "a"
      ],
      [
        "e",
        "-"
      ],
      [
        "f",
        "or"
      ],
      [
        "h",
        "y"
      ],
      [
        "h",
        "en"
      ],
      [
        "h",
        "ell"
      ],
      [
        "i",
        "k"
      ],
      [
        "i",
        "p"
      ],
      [
        "i",
        "r"
      ],
      [
        "i",
        "on"
      ],
      [
        "l",
        "e"
      ],
      [
        "l",
        "ik"
      ],
      [
        "n",
        "ot"
      ],
      [
        "o",
        "f"
      ],
      [
        "o",
        "p"
      ],
      [
        "o",
        "u"
      ],
      [
        "p",
        "hen"
      ],
      [
        "s",
        "p"
      ],
      [
        "s",
        "t"
      ],
      [
        "t",
        "es"
      ],
      [
        "th",
        "is"
      ],
      [
        "th",
        "at"
      ],
      [
        "ar",
        "g"
      ],
      [
        "at",
        "ion"
      ],
      [
        "ell",
        "-be"
      ],
      [
        "ti",
        "m"
      ],
      [
        "number",
        "s"
      ],
      [
        "T-sh",
        "ir"
      ],
      [
        "br",
        "ac"
      ],
      [
        "hy",
        "phen"
      ],
      [
        "hell",
        "o"
      ],
      [
        "lik",
        "e"
      ],
      [
        "tes",
        "t"
      ],
      [
        "ell-be",
        "ing"
      ],
      [
        "T-shir",
        "t"
      ],
      [
        "'",
        "s"
      ],
      [
        "-",
        "t"
      ],
      [
        "-",
        "th"
      ],
      [
        "-",
        "wor"
      ],
      [
        "A",
        "D"
      ],
      [
        "A",
        "t"
      ],
      [
        "B",
        "E"
      ],
      [
        "D",
        "E"
      ],
      [
        "E",
        "F"
      ],
      [
        "I",
        "t"
      ],
      [
        "W",
        "or"
      ],
      [
        "W",
        "ell-being"
      ],
      [
        "_",
        "n"
      ],
      [
        "_",
        "ca"
      ],
      [
        "a",
        "y"
      ],
      [
        "a",
        "th"
      ],
      [
        "a",
        "sh"
      ],
      [
        "c",
        "h"
      ],
      [
        "c",
        "i"
      ],
      [
        "c",
        "ar"
      ],
      [
        "c",
        "ent"
      ],
      [
        "d",
        "i"
      ],
      [
        "d",
        "o"
      ],
      [
        "d",
        "-wor"
      ],
      [
        "d",
        "ay"
      ],
      [
        "e",
        "d"
      ],
      [
        "e",
        "m"
      ],
      [
        "e",
        "v"
      ],
      [
        "e",
        "ci"
      ],
      [
        "f",
        "f"
      ],
      [
        "f",
        "ul"
      ],
      [
        "f",
        "unc"
      ],
      [
        "h",
        "ash"
      ],
      [
        "i",
        "c"
      ],
      [
        "i",
        "t"
      ],
      [
        "i",
        "x"
      ],
      [
        "i",
        "ab"
      ],
      [
        "j",
        "is"
      ],
      [
        "k",
        "et"
      ],
      [
        "l",
        "s"
      ],
      [
        "l",
        "on"
      ],
      [
        "m",
        "at"
      ],
      [
        "m",
        "ul"
      ],
      [
        "m",
        "ath"
      ],
      [
        "m",
        "ix"
      ],
      [
        "n",
        "ip"
      ],
      [
        "o",
        "nd"
      ],
      [
        "o",
        "jis"
      ],
      [
        "o",
        "ls"
      ],
      [
        "p",
        "er"
      ],
      [
        "p",
        "et"
      ],
      [
        "p",
        "unc"
      ],
      [
        "p",
        "ag"
      ],
      [
        "p",
        "le"
      ],
      [
        "q",
        "u"
      ],
      [
        "r",
        "es"
      ],
      [
        "r",
        "unc"
      ],
      [
        "s",
        "e"
      ],
      [
        "s",
        "o"
      ],
      [
        "s",
        "y"
      ],
      [
        "s",
        "er"
      ],
      [
        "s",
        "is"
      ],
      [
        "s",
        "nip"
      ],
      [
        "t",
        "u"
      ],
      [
        "t",
        "er"
      ],
      [
        "t",
        "ab"
      ],
      [
        "t",
        "op"
      ],
      [
        "t",
        "runc"
      ],
      [
        "u",
        "ser"
      ],
      [
        "v",
        "ar"
      ],
      [
        "w",
        "ell-being"
      ],
      [
        "w",
        "ond"
      ],
      [
        "x",
        "ab"
      ],
      [
        "x",
        "DE"
      ],
      [
        "x",
        "math"
      ],
      [
        "y",
        "th"
      ],
      [
        "er",
        "ent"
      ],
      [
        "er",
        "ful"
      ],
      [
        "er",
        "yth"
      ],
      [
        "ar",
        "t"
      ],
      [
        "ar",
        "ac"
      ],
      [
        "at",
        "e-"
      ],
      [
        "at",
        "ed"
      ],
      [
        "ll",
        "ar"
      ],
      [
        "ell",
        "ip"
      ],
      [
        "mb",
        "ols"
      ],
      [
        "ab",
        "ou"
      ],
      [
        "ac",
        "es"
      ],
      [
        "on",
        "_ca"
      ],
      [
        "sh",
        "ou"
      ],
      [
        "ti",
        "ple"
      ],
      [
        "ti",
        "on_ca"
      ],
      [
        "ot",
        "es"
      ],
      [
        "ul",
        "t"
      ],
      [
        "al",
        "so"
      ],
      [
        "am",
        "e"
      ],
      [
        "am",
        "p"
      ],
      [
        "ca",
        "se"
      ],
      [
        "e-",
        "art"
      ],
      [
        "for",
        "mat"
      ],
      [
        "le",
        "_n"
      ],
      [
        "not",
        "ation"
      ],
      [
        "of",
        "-th"
      ],
      [
        "op",
        "en"
      ],
      [
        "sp",
        "eci"
      ],
      [
        "sp",
        "aces"
      ],
      [
        "st",
        "ar"
      ],
      [
        "st",
        "ate-"
      ],
      [
        "tim",
        "e"
      ],
      [
        "tim",
        "es"
      ],
      [
        "brac",
        "e"
      ],
      [
        "brac",
        "ket"
      ],
      [
        "hyphen",
        "s"
      ],
      [
        "test",
        "ing"
      ],
      [
        "-t",
        "ag"
      ],
      [
        "AD",
        "BE"
      ],
      [
        "At",
        "-tag"
      ],
      [
        "It",
        "'s"
      ],
      [
        "Wor",
        "d-wor"
      ],
      [
        "ch",
        "arac"
      ],
      [
        "car",
        "et"
      ],
      [
        "di",
        "ff"
      ],
      [
        "do",
        "llar"
      ],
      [
        "em",
        "ojis"
      ],
      [
        "ev",
        "eryth"
      ],
      [
        "func",
        "tion_ca"
      ],
      [
        "iab",
        "le_n"
      ],
      [
        "lon",
        "g"
      ],
      [
        "mul",
        "tiple"
      ],
      [
        "per",
        "cent"
      ],
      [
        "pet",
        "s"
      ],
      [
        "punc",
        "tu"
      ],
      [
        "pag",
        "e"
      ],
      [
        "qu",
        "otes"
      ],
      [
        "res",
        "ult"
      ],
      [
        "sy",
        "mbols"
      ],
      [
        "snip",
        "pets"
      ],
      [
        "ter",
        "s"
      ],
      [
        "tab",
        "s"
      ],
      [
        "top",
        "ic"
      ],
      [
        "trunc",
        "ated"
      ],
      [
        "var",
        "iable_n"
      ],
      [
        "wond",
        "erful"
      ],
      [
        "xab",
        "c"
      ],
      [
        "xDE",
        "ADBE"
      ],
      [
        "ellip",
        "sis"
      ],
      [
        "abou",
        "t"
      ],
      [
        "shou",
        "ld"
      ],
      [
        "format",
        "s"
      ],
      [
        "of-th",
        "e-art"
      ],
      [
        "speci",
        "al"
      ],
      [
        "state-",
        "of-the-art"
      ],
      [
        "Word-wor",
        "d"
      ],
      [
        "charac",
        "ters"
      ],
      [
        "diff",
        "erent"
      ],
      [
        "everyth",
        "ing"
      ],
      [
        "function_ca",
        "ll"
      ],
      [
        "punctu",
        "ation"
      ],
      [
        "variable_n",
        "ame"
      ],
      [
        "xDEADBE",
        "EF"
      ]
    ]
  }
}